Updated charts to use mermaid
